{
  "title": "Sweet Potato Pie Baking Tips",
  "category": "technique",
  "items": [
    {"name": "Roast the sweet potatoes", "details": "Wash, poke 6-8 holes about 1 inch deep with a fork, and bake at 400F for 45-60 minutes until soft. Roasting brings out natural sweetness."},
    {"name": "Wrap in foil (optional)", "details": "Wrapping loosely in foil helps retain moisture. Leave some space for steam to escape."},
    {"name": "Mash thoroughly", "details": "After roasting, remove skins and mash sweet potatoes thoroughly to avoid lumps in the filling."},
    {"name": "Season with warm spices", "details": "Use a mix of cinnamon, nutmeg, and ginger for warmth and depth of flavor."},
    {"name": "Don't overmix the filling", "details": "Mix just until combined to keep the filling smooth and creamy."},
    {"name": "Crust options", "details": "A graham cracker crust adds sweet crunch; a traditional pie crust offers a flaky experience. You can split filling between two regular crusts if you don't have a deep-dish."},
    {"name": "Pre-bake the Pillsbury crust", "details": "Pre-bake in its metal tin on a baking sheet. Line with parchment and use pie weights or dried beans to prevent puffing. Remove weights for last few minutes to brown."},
    {"name": "Graham cracker crust pre-bake", "details": "Store-bought graham cracker crusts are usually ready to use. Optionally pre-bake at 350F for 5-7 minutes for extra crispness."},
    {"name": "Check for doneness", "details": "The pie is done when the filling is set around the edges but still slightly jiggly in the center. It firms up as it cools."},
    {"name": "Storage", "details": "Refrigerate sweet potato pie after cooling completely. Cover loosely with plastic wrap or foil. Keeps 3-4 days in the fridge."}
  ],
  "notes": "If your recipe calls for a 9-inch deep-dish crust but you have regular crusts, split the filling between two regular crusts and reduce baking time slightly since the pies will be thinner.",
  "source_conversation": "Sweet_Potato_Pie_Crust_541.json"
}