{
  "title": "Crispy Cranberry-Balsamic Skillet Chicken Thighs",
  "category": "chicken",
  "prep_time": 5,
  "cook_time": 25,
  "portion_count": "4 servings",
  "ingredients": [
    {
      "name": "bone-in skin-on chicken thighs",
      "amount": "4"
    },
    {
      "name": "Steer Dust rub (or similar beef/all-purpose rub)",
      "amount": "light coating"
    },
    {
      "name": "cranberry pear balsamic vinegar",
      "amount": "2-3 tbsp"
    },
    {
      "name": "water",
      "amount": "1 splash"
    },
    {
      "name": "avocado oil",
      "amount": "1/2 to 1 tsp"
    },
    {
      "name": "butter (optional, for sauce)",
      "amount": "1 small knob"
    },
    {
      "name": "salt",
      "amount": "as needed"
    }
  ],
  "directions": [
    "Pat chicken thighs completely dry. Season mostly on the meat side with Steer Dust (light hand). Salt the skin side lightly.",
    "Place thighs skin-side down in a cold cast iron skillet with just a light film of avocado oil or no oil at all.",
    "Turn heat to medium and let the fat render slowly for 8-10 minutes. Do not touch them.",
    "Once the skin is deeply golden and releases easily, flip the thighs.",
    "Cook the second side 8-12 minutes, partially covered, until internal temp reaches 165F.",
    "Remove chicken from the pan. Do NOT add balsamic while chicken is in the pan.",
    "Deglaze the pan with 2-3 tbsp cranberry pear balsamic and a splash of water. Simmer 1-2 minutes until glossy.",
    "Optional: finish sauce with a small knob of butter if glaze feels too sharp.",
    "Spoon glaze over chicken thighs and serve."
  ],
  "notes": "Start skin-side down in a COLD pan for the crispiest skin. Avocado oil is preferred over olive oil due to the high smoke point needed for rendering. Do not add the balsamic until after the chicken is removed - sugar + hot fat will burn. Keep Steer Dust off the pasta - it is a beef-forward, chili-heavy rub. For sides: toss penne with olive oil or butter and a spoon of the pan drippings/glaze. Roast frozen green beans at 425F for 18-22 minutes, finish with a tiny drizzle of cranberry balsamic. Do not use the mustard/pecan sauce with this meal as it will fight the balsamic.",
  "source_conversation": "Crispy_Chicken_Thighs_Recipe_44.json"
}