{
  "title": "Peppermint Espresso Martini",
  "category": "drink",
  "prep_time": 5,
  "cook_time": 0,
  "portion_count": "1 cocktail",
  "ingredients": [
    {
      "name": "vodka",
      "amount": "2 oz"
    },
    {
      "name": "brewed and cooled espresso",
      "amount": "36g (~1.2 oz)"
    },
    {
      "name": "Kahlua (or coffee liqueur)",
      "amount": "0.5 oz"
    },
    {
      "name": "homemade mint simple syrup",
      "amount": "0.5 oz"
    },
    {
      "name": "white chocolate peppermint sauce",
      "amount": "0.5 oz"
    },
    {
      "name": "ice",
      "amount": "a big handful"
    },
    {
      "name": "crushed candy canes (for rim)",
      "amount": "as needed"
    },
    {
      "name": "coffee beans (garnish)",
      "amount": "3"
    }
  ],
  "directions": [
    "Prepare the rim: Lightly brush the rim of a coupe or martini glass with peppermint sauce or simple syrup, then dip the rim into crushed candy canes. Set glass in the freezer while you shake the drink.",
    "In a cocktail shaker, combine vodka, cooled espresso, Kahlua, mint simple syrup, and white chocolate peppermint sauce.",
    "Add a big handful of ice and shake hard for 15-20 seconds to build foam and chill properly.",
    "Double strain into the chilled candy-cane-rimmed glass.",
    "Float 3 coffee beans on top. Optionally drizzle a whisper of peppermint sauce inside the glass before pouring for a swirl effect."
  ],
  "notes": "Mint syrup provides the freshness (0.5 oz is enough without taking over). White chocolate peppermint sauce adds body and a dessert factor without needing extra simple syrup. For a stronger mint hit, increase syrup to 0.75 oz. For sweeter and creamier, add another 0.25 oz of the sauce. For a stronger coffee punch, bump espresso to 1.25 oz and drop syrup slightly. Holiday variant: add 0.25 oz peppermint schnapps and reduce mint syrup to 0.25 oz so it doesn't go medicinal. Originally 1 oz espresso but user preferred 36g (~1.2 oz) which works well for more coffee depth.",
  "source_conversation": "Peppermint_espresso_martini_recipe_55.json"
}