{
  "title": "Peri-Peri Glazed Salmon Bowl",
  "category": "seafood",
  "prep_time": 10,
  "cook_time": 22,
  "portion_count": "2 servings",
  "ingredients": [
    {
      "name": "salmon fillets",
      "amount": "2 (6 oz each)"
    },
    {
      "name": "Trader Joe's Peri-Peri Sauce",
      "amount": "3-4 tbsp"
    },
    {
      "name": "olive oil or melted butter",
      "amount": "1 tsp"
    },
    {
      "name": "salt",
      "amount": "to taste"
    },
    {
      "name": "black pepper",
      "amount": "to taste"
    },
    {
      "name": "garlic powder",
      "amount": "1/4 tsp"
    },
    {
      "name": "smoked paprika",
      "amount": "1/4 tsp"
    },
    {
      "name": "lemon pepper",
      "amount": "light coat"
    },
    {
      "name": "zucchini",
      "amount": "1"
    },
    {
      "name": "yellow squash",
      "amount": "1"
    },
    {
      "name": "olive oil (for veggies)",
      "amount": "1 tbsp"
    },
    {
      "name": "white rice, cooked",
      "amount": "2 cups"
    },
    {
      "name": "honey (optional, for finishing)",
      "amount": "1 tsp"
    },
    {
      "name": "fresh parsley or cilantro (optional)",
      "amount": "for garnish"
    },
    {
      "name": "sesame seeds (optional)",
      "amount": "for garnish"
    }
  ],
  "directions": [
    "Preheat oven to 425F.",
    "Slice zucchini and squash into half-moons or thin rounds. Toss with olive oil, salt, pepper, garlic powder, and smoked paprika. Spread on a parchment-lined pan. Roast alone for 8-10 minutes.",
    "Pat salmon dry. Rub with olive oil, salt, pepper, lemon pepper, and garlic powder. Brush 1.5 tbsp of Peri-Peri sauce per fillet on top.",
    "After veggies have roasted 8-10 minutes, push them aside and add salmon to the pan (or use a second tray on the middle rack).",
    "Roast both together for 12-14 more minutes until salmon is flaky and veggies are lightly browned.",
    "Remove from oven. Brush a little more Peri-Peri sauce on the salmon while hot. Squeeze lemon or sprinkle lemon pepper over veggies.",
    "Optional honey-lemon-pepper finish: mix 1 tsp honey, 1/2 tsp Peri-Peri sauce, and a pinch of lemon pepper. Warm slightly and drizzle over salmon.",
    "Assemble bowl: Season rice with a pinch of salt and drizzle of olive oil or butter. Add veggies around or beside the rice. Place salmon on top. Drizzle with extra Peri-Peri sauce mixed with olive oil. Garnish with parsley and sesame seeds."
  ],
  "notes": "Lemon pepper can replace fresh lemon throughout the recipe. For the honey-lemon-pepper finish glaze, warm the mixture 10-15 seconds in the microwave so it thins out. If using two oven racks, put salmon on the middle rack and veggies on the lower rack, swap trays halfway through. Alternative sauces from the conversation: fig balsamic + spicy honey glaze, or red pepper almond pesto thinned with olive oil and lemon juice.",
  "source_conversation": "Salmon_sauce_suggestions_81.json"
}