{
  "title": "Peri-Peri Chicken with Roasted Green Beans and Spanish Rice",
  "category": "chicken",
  "prep_time": 10,
  "cook_time": 20,
  "portion_count": "2-3 servings",
  "ingredients": [
    {
      "name": "chicken breast",
      "amount": "1 lb"
    },
    {
      "name": "Trader Joe's Peri-Peri Sauce",
      "amount": "2-3 tbsp"
    },
    {
      "name": "Knorr Spanish Rice",
      "amount": "1 package"
    },
    {
      "name": "green beans",
      "amount": "1 bunch"
    },
    {
      "name": "avocado",
      "amount": "1"
    },
    {
      "name": "sriracha mayo",
      "amount": "for drizzling"
    },
    {
      "name": "avocado or olive oil",
      "amount": "for cooking"
    },
    {
      "name": "olive oil (for green beans)",
      "amount": "1-2 tbsp"
    },
    {
      "name": "salt",
      "amount": "to taste"
    },
    {
      "name": "black pepper",
      "amount": "to taste"
    },
    {
      "name": "garlic powder",
      "amount": "to taste"
    },
    {
      "name": "smoked paprika",
      "amount": "to taste"
    },
    {
      "name": "cumin (optional)",
      "amount": "small pinch"
    },
    {
      "name": "chili flakes (optional, for green beans)",
      "amount": "pinch"
    },
    {
      "name": "olive oil or butter (for rice finishing)",
      "amount": "0.5-1 tbsp"
    }
  ],
  "directions": [
    "Preheat oven to 425°F. Toss green beans with olive oil, salt, pepper, garlic powder, and optional chili flakes. Roast for 15-20 minutes, tossing once.",
    "Butterfly the chicken breast, then slice into 1/2-inch strips across the grain. Season with salt, black pepper, garlic powder, smoked paprika, and optional cumin.",
    "Heat skillet over medium-high with avocado or olive oil. Add chicken in a single layer without crowding. Cook about 3 minutes per side until lightly browned.",
    "Kill the heat, then toss chicken with 2-3 tbsp peri-peri sauce. Rest for 2 minutes.",
    "Cook the Knorr Spanish Rice according to package directions. When done, fluff and stir in 0.5-1 tbsp olive oil or butter. Optionally add a tiny squeeze of peri-peri or a pinch of smoked paprika.",
    "Optionally finish green beans with a light drizzle of peri-peri.",
    "Slice or cube the avocado and season with salt (and lime/lemon juice if available).",
    "Plate: Rice base, chicken on top, green beans alongside, avocado on top, and a zig-zag drizzle of sriracha mayo to finish."
  ],
  "notes": "Spanish rice fits better than white rice here because the tomato and pepper base matches the peri-peri heat. White rice would be too neutral. Skip BBQ sauce for this dish as it clashes with the Spanish rice. Peri-peri is the primary sauce, sriracha mayo provides the creamy contrast. Avocado goes on top fresh (not cooked).",
  "source_conversation": "Quick_Chicken_Sides_36.json"
}