{
  "title": "Pineapple Teriyaki Meatball Rice Bowls with Triple-Sauce Glaze",
  "category": "chicken",
  "prep_time": 5,
  "cook_time": 15,
  "portion_count": "2-3 servings",
  "ingredients": [
    {
      "name": "Trader Joe's Pineapple Teriyaki Chicken Meatballs",
      "amount": "1 package"
    },
    {
      "name": "cooked white or jasmine rice",
      "amount": "2 cups"
    },
    {
      "name": "mixed stir-fry vegetables (bell peppers, broccoli, snap peas, carrots)",
      "amount": "2 cups"
    },
    {
      "name": "Bachan's Japanese Barbecue Sauce",
      "amount": "2 tbsp"
    },
    {
      "name": "Trader Joe's Hoisin Sauce",
      "amount": "1 tbsp"
    },
    {
      "name": "Kikkoman Sweet Chili Sauce",
      "amount": "1 tbsp plus extra for drizzle"
    },
    {
      "name": "soy sauce (optional)",
      "amount": "1-2 tsp"
    },
    {
      "name": "sesame oil (optional)",
      "amount": "1 tsp"
    },
    {
      "name": "green onions (sliced)",
      "amount": "for garnish"
    },
    {
      "name": "sesame seeds",
      "amount": "for garnish"
    }
  ],
  "directions": [
    "Cook rice and have it ready and warm.",
    "Heat meatballs in a skillet over medium heat with a splash of oil for 6-8 minutes until warmed through and lightly browned. Add 2 tbsp Bachan's Japanese Barbecue Sauce and toss until glazed and sticky.",
    "In another pan (or same skillet once meatballs are done), heat 1 tsp sesame oil. Add vegetables and stir-fry 4-5 minutes. Add 1 tbsp Hoisin Sauce and a splash of soy sauce, toss until coated.",
    "Assemble bowls: scoop rice into bowls, top with saucy vegetables and glazed meatballs.",
    "Drizzle Sweet Chili Sauce over everything right before serving.",
    "Garnish with sliced green onions and sesame seeds."
  ],
  "notes": "Sauce layering creates sweet, savory, tangy, and a bit of heat without clashing: Bachan's is the savory umami base for meatballs, Hoisin is the sweet rich sauce for veggies, Sweet Chili is the bright sweet-spicy finishing drizzle. Variations: use butter lettuce wraps instead of rice for lighter option, swap rice for lo mein or soba noodles, or make a quick extra glaze by whisking 2 tbsp soy sauce + 1 tbsp honey + 1 tsp rice vinegar.",
  "source_conversation": "Dinner_meal_suggestion_124.json"
}