{
  "title": "Spicy Honey Balsamic Chicken Strip Bowl",
  "category": "chicken",
  "prep_time": 10,
  "cook_time": 15,
  "portion_count": "3-4 servings",
  "ingredients": [
    {
      "name": "boneless chicken breast, sliced into 1/2-inch strips",
      "amount": "560g (about 1 1/4 lb)"
    },
    {
      "name": "Trader Joe's Spicy Honey Sauce",
      "amount": "2 1/2 tbsp"
    },
    {
      "name": "fig balsamic vinegar",
      "amount": "1 1/2 tbsp"
    },
    {
      "name": "soy sauce",
      "amount": "1 tbsp"
    },
    {
      "name": "olive oil",
      "amount": "1 tsp plus more for cooking"
    },
    {
      "name": "salt",
      "amount": "to taste"
    },
    {
      "name": "black pepper",
      "amount": "to taste"
    },
    {
      "name": "garlic powder",
      "amount": "small dash"
    },
    {
      "name": "cooked rice",
      "amount": "for serving"
    },
    {
      "name": "Brussels sprouts (seasoned with garlic powder, onion powder, paprika)",
      "amount": "for serving"
    }
  ],
  "directions": [
    "Slice chicken breast into 1/2-inch strips against the grain.",
    "Season strips lightly with salt and pepper.",
    "Mix the sauce: combine spicy honey sauce, fig balsamic vinegar, soy sauce, olive oil, salt, pepper, and garlic powder.",
    "Heat oil in a skillet over medium-high. Sear chicken strips until browned and cooked through, about 6-8 minutes total.",
    "Lower heat and pour in the sauce mix. Toss for 30-60 seconds until it thickens and coats the chicken.",
    "Reserve a few spoonfuls of sauce in the pan to drizzle over the rice and Brussels sprouts.",
    "Assemble bowls with rice, roasted Brussels sprouts, and glazed chicken strips. Drizzle with extra sauce."
  ],
  "notes": "One of three sauce options for chicken strip bowls. The spicy honey + fig balsamic creates sweet heat with a tangy finish that pairs beautifully with paprika-garlic Brussels sprouts. Alternative sauce options: (1) Peri-Peri Glaze -- 3 tbsp peri-peri sauce, 1 tbsp olive oil, 1/2 tbsp honey; (2) Roasted Red Pepper Almond Pesto -- 3 tbsp pesto, 1.5 tbsp olive oil, 1 tbsp water. Season Brussels with garlic powder, onion powder, and paprika.",
  "source_conversation": "Chicken_breast_cooking_ideas_89.json"
}