{
  "title": "Strawberry-Honey-Balsamic Glazed Wings",
  "category": "chicken",
  "prep_time": 10,
  "cook_time": 20,
  "portion_count": "4 servings",
  "ingredients": [
    {
      "name": "chicken wings",
      "amount": "1.5-2 lb"
    },
    {
      "name": "Spicy Honey Sauce",
      "amount": "2 tbsp"
    },
    {
      "name": "Strawberry Jalapeno Jam",
      "amount": "2 tbsp"
    },
    {
      "name": "Black Mission Fig Balsamic Vinegar",
      "amount": "1 tbsp"
    },
    {
      "name": "salt",
      "amount": "to taste"
    },
    {
      "name": "black pepper",
      "amount": "to taste"
    },
    {
      "name": "garlic powder",
      "amount": "to taste"
    },
    {
      "name": "chili flakes (optional)",
      "amount": "pinch"
    },
    {
      "name": "Peri-Peri sauce (optional, for extra heat)",
      "amount": "splash"
    }
  ],
  "directions": [
    "Pat wings dry and toss with salt, pepper, and garlic powder.",
    "Air fry at 380°F for 18-20 minutes, flipping halfway through, until golden and crisp. (Alternative: oven-bake at 425°F for about 40 minutes.)",
    "While wings cook, make the glaze: In a small saucepan over low heat, whisk together Spicy Honey, Strawberry Jalapeno Jam, and Black Mission Fig Balsamic Vinegar. Optionally add chili flakes or a splash of Peri-Peri sauce. Simmer for 3-4 minutes until thick and glossy.",
    "Toss the hot wings in about half the glaze immediately after cooking.",
    "Brush on the remaining glaze and pop them back in the air fryer for 1-2 minutes at 380°F to lightly caramelize.",
    "Serve immediately."
  ],
  "notes": "Do NOT marinate the wings in the glaze before cooking. The sugar from the honey and jam will burn during air frying giving bitter, blackened skin. The acid from balsamic will break down the skin making it rubbery instead of crisp. Cook wings dry first, then drench in glaze after. The two-stage glazing approach (toss in half, brush the rest on, then flash-fry) gives maximum flavor and sticky, lacquered wings without burning the sauce. Optional: finish with fresh rosemary or thyme to echo roasted potato sides.",
  "source_conversation": "Peri_peri_chicken_tenders_92.json"
}